//-------------------------РІК НАРОДЖЕННЯ----------------------------//

let birthday = prompt("В якому році Ви народились?");

if (birthday === null) {
  alert("Шкода, що Ви не захотіли ввести свій день народження =(");
} else if (birthday.trim() === "") {
  alert("Ви ввести пусте значення =(");
} else if (+birthday !== +birthday) {
  alert('Ви ввели не коректні дані =(');
} else if (+birthday < 1910 || +birthday > 2023){
  alert("Бути такого не може =)");
} else {
  alert(`Ви народилися в ${birthday} році`);
}

//-------------------------МІСТО ПРОЖИВАННЯ----------------------------//

let town = prompt("В якому місті Ви живете?");

if (town === null) {
  alert("Шкода, що Ви не захотіли ввести місто, де живете =(");
} else if (town.trim() === '') {
  alert("Ви ввести пусте значення =(");
} else if (town === "Київ") {
  alert("Ти живеш у столиці України");
} else if (town === "Вашингтон") {
  alert("Ти живеш у столиці США");
} else if (town === "Лондон") {
  alert("Ти живеш у столиці Великобританії");
} else {
  alert(`Ти живеш у місті ${town}`);
}


//-------------------------ВИД СПОРТУ----------------------------//

let sport = prompt("Який улюблений вид спорту?");

if (sport === null) {
  alert("Шкода, що Ви не захотіли ввести Ваш улюблений вид спорту =(");
} else if (sport.trim() === "") {
  alert("Ви ввести пусте значення =(");
} else if (sport === "футбол") {
  alert("Круто! Хочеш стати Андрієм Шевченко!");
} else if (sport === "бокс") {
  alert("Круто! Хочеш стати Олександром Усиком!");
} else if (sport === "теніс") {
  alert("Круто! Хочеш стати Еліною Світоліною!");
} else {
  alert("Круто! Хочеш вся Україна в тебе вірить!!!");
}
